In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',    '102',    '103',      '104',   '106',    '108',    '110',    '111',      '113'],
            'City'      :['Tokyo',   'Osaka',  'Kyoto',  'Hokkaido', 'Tokyo', 'Tokyo',  'Osaka',  'Kyoto',  'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,     1992,     1997,       1982,    1991,     1988,     1990,     1995,       1981],
            'Name'      :['Hiroshi', 'Akiki',  'Yuki',   'Satoru',   'Steve', 'Mituru', 'Aoi',    'Tarou',  'Suguru',   'Mitsuo'],
            'Region'    :['Kanto',   'Kansai', 'Kansai', 'Hokkaido', 'Kanto', 'Kanto',  'Kansai', 'Kansai', 'Hokkaido', 'Kanto']}
table = pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
table

    ID      City  Birth_year     Name    Region
a  100     Tokyo        1990  Hiroshi     Kanto
b  101     Osaka        1989    Akiki    Kansai
c  102     Kyoto        1992     Yuki    Kansai
d  103  Hokkaido        1997   Satoru  Hokkaido
e  104     Tokyo        1982    Steve     Kanto
f  106     Tokyo        1991   Mituru     Kanto
g  108     Osaka        1988      Aoi    Kansai
h  110     Kyoto        1990    Tarou    Kansai
i  111  Hokkaido        1995   Suguru  Hokkaido
j  113     Tokyo        1981   Mitsuo     Kanto

### 特定Column

In [3]:
table.ID

a    100
b    101
c    102
d    103
e    104
f    106
g    108
h    110
i    111
j    113
Name: ID, dtype: object

In [4]:
table[['ID', 'City']]

    ID      City
a  100     Tokyo
b  101     Osaka
c  102     Kyoto
d  103  Hokkaido
e  104     Tokyo
f  106     Tokyo
g  108     Osaka
h  110     Kyoto
i  111  Hokkaido
j  113     Tokyo

In [5]:
col = table.columns
print(col)

table[col[:2]]

Index(['ID', 'City', 'Birth_year', 'Name', 'Region'], dtype='object')

    ID      City
a  100     Tokyo
b  101     Osaka
c  102     Kyoto
d  103  Hokkaido
e  104     Tokyo
f  106     Tokyo
g  108     Osaka
h  110     Kyoto
i  111  Hokkaido
j  113     Tokyo

### 特定Row

In [6]:
table.loc[['a', 'b']]

    ID   City  Birth_year     Name  Region
a  100  Tokyo        1990  Hiroshi   Kanto
b  101  Osaka        1989    Akiki  Kansai

In [7]:
row = table.index
print(row)

table.loc[row[:2]]

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

    ID   City  Birth_year     Name  Region
a  100  Tokyo        1990  Hiroshi   Kanto
b  101  Osaka        1989    Akiki  Kansai

### loc, iloc, at, iat

loc->index邏輯，可以訪問多個位置，慢

In [8]:
table.loc[['a', 'b']]

    ID   City  Birth_year     Name  Region
a  100  Tokyo        1990  Hiroshi   Kanto
b  101  Osaka        1989    Akiki  Kansai

iloc->座標邏輯，可以訪問多個位置，慢

In [9]:
table.iloc[4:, 2:]

   Birth_year    Name    Region
e        1982   Steve     Kanto
f        1991  Mituru     Kanto
g        1988     Aoi    Kansai
h        1990   Tarou    Kansai
i        1995  Suguru  Hokkaido
j        1981  Mitsuo     Kanto

at->index與column邏輯，只能訪問單一位置，快

In [10]:
table.at['a', 'Name']

'Hiroshi'

iat->座標邏輯，只能訪問單一位置，快

In [11]:
table.iat[0, 3]

'Hiroshi'

### 轉置

In [12]:
table.T

,a,b,c,d,e,f,g,h,i,j
ID,100,101,102,103,104,106,108,110,111,113
City,Tokyo,Osaka,Kyoto,Hokkaido,Tokyo,Tokyo,Osaka,Kyoto,Hokkaido,Tokyo
Birth_year,1990,1989,1992,1997,1982,1991,1988,1990,1995,1981
Name,Hiroshi,Akiki,Yuki,Satoru,Steve,Mituru,Aoi,Tarou,Suguru,Mitsuo
Region,Kanto,Kansai,Kansai,Hokkaido,Kanto,Kanto,Kansai,Kansai,Hokkaido,Kanto

### 參考資料
- https://hippocampus-garden.com/pandas_loc/
- https://stackoverflow.com/questions/28757389/pandas-loc-vs-iloc-vs-at-vs-iat